---
title: Database
date: 2021-12-01 13:53:42
tags: 考研
---
### 数据库
数据库事务正确执行的四个基本要素：（ACID）
A:原子性（atomicity）
C:一致性（consistency）
I:隔离性（isolation）
D:持续性（durability）


### 关系操作和关系数据语言 SQL

关系是
$$ 域D_1,D_2,D_3... $$
笛卡尔积的子集

1.SQL是集：数据定义(DDL)，数据查询，数据控制(DCL)，数据操纵(DML) 于一体的结构化查询语言
2.基本的关系操作包括：增删改查，(查询包括：交并差除，连接，投影，选择，笛卡尔积)
> 选择，投影，并，差，笛卡尔积，是五种基本操作

3.关系操作的对象和结果都是集合
4.关系模式: R(U,D,DOM,F)
5.关系的完整性包括：实体完整性，参照完整性和，用户定义完整性
6.如果一组属性可以唯一的标识一个元组且他的子集不可以，那么称该属性组为候选码；
  如果一个关系有多个候选码，选择其中一个为主码；
  不属于任何候选码的属性称为非主属性/非码属性
7.关系操作的对象和结果都是集合
8.任意两个元组的候选码不能取相同的值


